views/report/report.php

SELECT COUNT(*) FROM `reports`
SELECT * FROM `reports` WHERE `id` IS NULL
---
use yii\data\ActiveDataProvider;
use app\models\Report;

$dataProvider = new ActiveDataProvider([
    'query' => Report::find(),
    'pagination' => [
        'pageSize' => 10,
    ]
]);